###################################################################

# Created by write_sdc on Fri Jan 29 08:52:17 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports PCWrite_IF_ID_Write]
set_load -pin_load 3.40189 [get_ports PCSrc_MEM_out]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[31]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[30]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[29]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[28]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[27]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[26]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[25]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[24]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[23]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[22]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[21]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[20]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[19]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[18]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[17]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[16]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[15]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[14]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[13]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[12]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[11]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[10]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[9]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[8]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[7]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[6]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[5]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[4]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[3]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[2]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[1]}]
set_load -pin_load 3.40189 [get_ports {ALUout_EX_out[0]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[31]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[30]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[29]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[28]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[27]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[26]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[25]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[24]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[23]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[22]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[21]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[20]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[19]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[18]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[17]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[16]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[15]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[14]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[13]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[12]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[11]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[10]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[9]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[8]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[7]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[6]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[5]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[4]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[3]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[2]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[1]}]
set_load -pin_load 3.40189 [get_ports {ALU_bypass_EX_out[0]}]
set_load -pin_load 3.40189 [get_ports MemRead]
set_load -pin_load 3.40189 [get_ports MemWrite]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[31]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[30]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[29]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[28]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[27]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[26]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[25]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[24]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[23]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[22]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[21]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[20]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[19]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[18]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[17]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[16]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[15]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[14]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[13]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[12]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[11]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[10]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[9]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[8]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[7]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[6]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[5]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[4]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[3]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[2]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[1]}]
set_load -pin_load 3.40189 [get_ports {mux_IF_out[0]}]
create_clock [get_ports clk]  -name MY_CLK  -period 2.8  -waveform {0 0.995}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_ID_in[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Read_data_WB_in[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports PCWrite_IF_ID_Write]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports PCSrc_MEM_out]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALUout_EX_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {ALU_bypass_EX_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemRead]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemWrite]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {mux_IF_out[0]}]
